In [1]:
%matplotlib inline

In [2]:
import matplotlib as plt
import numpy as np
import pandas as pd

In [3]:

city_data_to_load=("Resources/city_data.csv")
ride_data_to_load=("Resources/ride_data.csv")

In [4]:
# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [5]:
city_data_df.tail(10)

                  city  driver_count   type
110         Lake Jamie             4  Rural
111    Lake Latoyabury             2  Rural
112        North Jaime             1  Rural
113  South Marychester             1  Rural
114          Garzaport             7  Rural
115       Bradshawfurt             7  Rural
116       New Ryantown             2  Rural
117     Randallchester             9  Rural
118        Jessicaport             1  Rural
119    South Saramouth             7  Rural

In [6]:
ride_data_df=pd.read_csv(ride_data_to_load)
ride_data_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

In [7]:
ride_data_df.tail(10)

                 city                 date   fare        ride_id
2365       Lake Jamie  2019-04-19 04:32:47  16.29  3518682119233
2366      North Holly  2019-03-18 10:38:05  40.34  3787775176860
2367      Michaelberg  2019-01-27 18:43:05  38.42   862622008020
2368       Lake Jamie  2019-04-29 01:58:44  54.22  2489264790267
2369     Bradshawfurt  2019-01-30 10:55:23  51.39  1328274868072
2370      Michaelberg  2019-04-29 17:04:39  13.38  8550365057598
2371  Lake Latoyabury  2019-01-30 00:05:47  20.76  9018727594352
2372      North Jaime  2019-02-10 21:03:50  11.11  2781339863778
2373     West Heather  2019-05-07 19:22:15  44.94  4256853490277
2374       Newtonview  2019-04-25 10:20:13  55.84  9990581345298

In [8]:
# Get the columns and the rows that are not null.
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [9]:
# Get the columns and the rows that are not null.
city_data_df.isnull()

      city  driver_count   type
0    False         False  False
1    False         False  False
2    False         False  False
3    False         False  False
4    False         False  False
..     ...           ...    ...
115  False         False  False
116  False         False  False
117  False         False  False
118  False         False  False
119  False         False  False

[120 rows x 3 columns]

In [10]:
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [11]:
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [12]:
city_data_df.sum()

city            RichardfortWilliamsstadPort AngelaRodneyfortWe...
driver_count                                                 2973
type            UrbanUrbanUrbanUrbanUrbanUrbanUrbanUrbanUrbanU...
dtype: object

In [13]:
# Get the unique values of the type of city.
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [14]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Urban","Suburban")

TypeError: sum() can't sum strings [use ''.join(seq) instead]

In [ ]:
city_data_df["type"]

In [ ]:
city_data_df["type"].count()

In [ ]:
urban_count = 0
Suburban_count = 0
Rural_count = 0
for types in city_data_df:
    if(city_data_df[types]=="Urban"):
        urban_count += 1
    elif(city_data_df[types]=="Suburban"):
        Suburban_count +=1
    else:
        Rural_count += 1

print(urban_count, Suburban_count, Rural_count)

In [ ]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Urban")

In [ ]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Suburban")

In [ ]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Rural")

In [ ]:
# Get the columns and the rows that are not null.
ride_data_df.count()

In [ ]:
# Get the columns and the rows that are not null.
ride_data_df.isnull().sum()

In [ ]:
# Get the data types of each column.
ride_data_df.dtypes

In [ ]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()